app/controllers/api/v1/beaches_controller.rb

  def index
    @beaches = Beach.all
---
SELECT "beaches".* FROM "beaches"

  def create
    @beach = Beach.new(beach_params)

    if @beach.save
---
INSERT INTO "beaches" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "delete this"], ["country", "delete this"], ["created_at", "2021-06-05 01:59:49.491516"], ["updated_at", "2021-06-05 01:59:49.491516"]]

  def update
    if @beach.update(beach_params)
---
UPDATE "beaches" SET "name" = ?, "country" = ?, "updated_at" = ? WHERE "beaches"."id" = ?  [["name", "Pcb"], ["country", "Pcb"], ["updated_at", "2021-06-17 22:15:58.037525"], ["id", 21]]

  def destroy
   if @beach.destroy
---
DELETE FROM "beaches" WHERE "beaches"."id" = ?  [["id", 14]]

  def set_beach
    @beach = Beach.find(params[:id])
---
SELECT "beaches".* FROM "beaches" WHERE "beaches"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]